{"keyword": "software engineer", "location": "California", "page": 1, "position": 12, "company": null, "jobkey": "b3bdcb07ff74c8e8", "jobTitle": null, "jobDescription": "<div>\n <div>\n  <div>\n   <div>\n    <h2 class=\"jobSectionHeader\"><b>Summary</b></h2> \n    <div>\n     <div>\n      Posted: Jul 5, 2023\n     </div> \n     <div>\n      Weekly Hours: \n      <b>40</b>\n     </div> \n     <div>\n      Role Number:\n      <b>200489550</b>\n     </div> \n    </div>\n    <div>\n     The Internationalization team’s mission is to make Apple’s software accessible to everyone, no matter where in the world they may be. The team is responsible for internationalization frameworks—including open-source projects like ICU &amp; CLDR—that power the entire operating system and enable both Apple and third-party developers to localize their apps. Internationalization team members also represent Apple at the Unicode Consortium and are vocal advocates for better language support and for making emojis more inclusive. We are looking for a software engineer who is passionate about languages, someone who is empathetic and wants to create solutions for customers across a wide variety of languages and regions!\n    </div> \n   </div>\n  </div>\n </div>\n <div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <h2 class=\"jobSectionHeader\"><b>Key Qualifications</b></h2> \n     </div>\n     <div>\n      <div>\n       <ul>\n        <li>Proficiency with a C-like dialect (Java, C, C++, Objective-C, Swift, etc.)</li> \n        <li>Solid understanding of algorithms, data structures and coding standards</li> \n        <li>Familiar with unit testing, with a strong focus on high-quality software</li> \n        <li>Passion for language, internationalization and/or localization engineering, and for improving Apple’s products</li> \n        <li>Excellent communication and organizational skills</li> \n        <li>Nice to have) Experience with various languages and cultures</li> \n       </ul>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <h2 class=\"jobSectionHeader\"><b>Description</b></h2> \n     </div>\n     <div>\n      <div>\n       In this role, you will: Write code within frameworks such as ICU (icu-project.org), Foundation, Swift, SwiftUI, and UIKit/AppKit to implement features that are used to internationalize all of Apple’s major platforms: iOS, macOS, watchOS, tvOS Contribute to the code that powers automatic grammatical agreement and work closely with language experts to implement language-specific features Actively participate in creating proposals for APIs used by engineers—both at Apple as well as by the wider Apple Developer community—to correctly internationalize and localize their apps Collaborate with different teams to solve both design and engineering localizability challenges and ensure that the next generation of experiences can reach all Apple customers Contribute to the wider internationalization community outside of Apple such as the Open Source ICU and CLDR projects\n      </div> \n     </div>\n    </div>\n   </div>\n  </div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <h2 class=\"jobSectionHeader\"><b>Education &amp; Experience</b></h2> \n     </div>\n     <div>\n      <div>\n       BS or MS in Computer Science or a related field\n      </div> \n     </div>\n    </div>\n   </div>\n  </div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <h2 class=\"jobSectionHeader\"><b>Additional Requirements</b></h2> \n     </div>\n     <div>\n      <div>\n       <ul>\n        <ul>\n         <li>Creating Apps for a Global Audience: https://developer.apple.com/videos/play/wwdc2018/201/ (https://developer.apple.com/videos/play/wwdc2018/201/)</li>\n        </ul> \n        <ul>\n         <li>Formatters: Making Data Human-Friendly: https://developer.apple.com/videos/play/wwdc2020/10160/ (https://developer.apple.com/videos/play/wwdc2020/10160/)</li>\n        </ul> \n        <ul>\n         <li>What’s New in Foundation: https://developer.apple.com/videos/play/wwdc2021/10109/ (https://developer.apple.com/videos/play/wwdc2021/10109/)</li>\n        </ul> \n        <ul>\n         <li>Localize your SwiftUI app: https://developer.apple.com/videos/play/wwdc2021/10220/ (https://developer.apple.com/videos/play/wwdc2021/10220/)</li>\n        </ul> \n        <ul>\n         <li>The Practice of Inclusive Design: https://developer.apple.com/videos/play/wwdc2021/10275/ (https://developer.apple.com/videos/play/wwdc2021/10275/)</li>\n        </ul> \n       </ul>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <h2 class=\"jobSectionHeader\"><b>Pay &amp; Benefits</b></h2> \n     </div>\n     <div>\n      <div>\n       <ul>\n        <li>At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $130,000 and $242,000, and your base pay will depend on your skills, qualifications, experience, and location.<br> <br> Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.<br> <br> Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.</li>\n       </ul>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n </div>\n</div>"}
